{"format": "graph-model", "generatedBy": "2.6.0", "convertedBy": "TensorFlow.js Converter v3.15.0", "signature": {"inputs": {"input_1": {"name": "input_1:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "4"}]}}}, "outputs": {"output_1": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "7"}]}}}}, "modelTopology": {"node": [{"name": "input_1", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "4"}]}}}}, {"name": "StatefulPartitionedCall/brdf_decoder/StatefulPartitionedCall/fourier_embedding/Shape", "op": "Shape", "input": ["input_1"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/brdf_decoder/StatefulPartitionedCall/fourier_embedding/ExpandDims/dim", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/brdf_decoder/StatefulPartitionedCall/fourier_embedding/mul/y", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "10"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/brdf_decoder/StatefulPartitionedCall/fourier_embedding/strided_slice/stack", "op": "Const", "input": ["^input_1"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/brdf_decoder/StatefulPartitionedCall/fourier_embedding/strided_slice/stack_1", "op": "Const", "input": ["^input_1"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/brdf_decoder/StatefulPartitionedCall/fourier_embedding/strided_slice/stack_2", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/brdf_decoder/StatefulPartitionedCall/fourier_embedding/mul_1/x", "op": "Const", "input": ["^input_1"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/brdf_decoder/StatefulPartitionedCall/fourier_embedding/strided_slice_1/stack", "op": "Const", "input": ["^input_1"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/brdf_decoder/StatefulPartitionedCall/fourier_embedding/strided_slice_1/stack_1", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/brdf_decoder/StatefulPartitionedCall/fourier_embedding/strided_slice_1/stack_2", "op": "Const", "input": ["^input_1"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/brdf_decoder/StatefulPartitionedCall/fourier_embedding/concat/axis", "op": "Const", "input": ["^input_1"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/brdf_decoder/StatefulPartitionedCall/fourier_embedding/add/y", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/brdf_decoder/StatefulPartitionedCall/fourier_embedding/concat_1/axis", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/brdf_decoder/StatefulPartitionedCall/fourier_embedding/concat_2/axis", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/brdf_decoder/StatefulPartitionedCall/sequential/dense/MatMul/ReadVariableOp", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "84"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/brdf_decoder/StatefulPartitionedCall/sequential/dense/BiasAdd/ReadVariableOp", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/brdf_decoder/StatefulPartitionedCall/sequential/dense_3/MatMul/ReadVariableOp", "op": "Const", "input": ["^input_1"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}, {"size": "7"}]}}}}}, {"name": "StatefulPartitionedCall/brdf_decoder/StatefulPartitionedCall/sequential/dense_1/MatMul/ReadVariableOp", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/brdf_decoder/StatefulPartitionedCall/sequential/dense_1/BiasAdd/ReadVariableOp", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/brdf_decoder/StatefulPartitionedCall/sequential/dense_3/BiasAdd/ReadVariableOp", "op": "Const", "input": ["^input_1"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "7"}]}}}}}, {"name": "StatefulPartitionedCall/brdf_decoder/StatefulPartitionedCall/sequential/dense_2/MatMul/ReadVariableOp", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/brdf_decoder/StatefulPartitionedCall/sequential/dense_2/BiasAdd/ReadVariableOp", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/brdf_decoder/StatefulPartitionedCall/fourier_embedding/ExpandDims", "op": "ExpandDims", "input": ["input_1", "StatefulPartitionedCall/brdf_decoder/StatefulPartitionedCall/fourier_embedding/ExpandDims/dim"], "attr": {"T": {"type": "DT_FLOAT"}, "Tdim": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/brdf_decoder/StatefulPartitionedCall/fourier_embedding/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/brdf_decoder/StatefulPartitionedCall/fourier_embedding/Shape", "StatefulPartitionedCall/brdf_decoder/StatefulPartitionedCall/fourier_embedding/strided_slice/stack", "StatefulPartitionedCall/brdf_decoder/StatefulPartitionedCall/fourier_embedding/strided_slice/stack_1", "StatefulPartitionedCall/brdf_decoder/StatefulPartitionedCall/fourier_embedding/strided_slice/stack_2"], "attr": {"begin_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/brdf_decoder/StatefulPartitionedCall/fourier_embedding/strided_slice_1", "op": "StridedSlice", "input": ["StatefulPartitionedCall/brdf_decoder/StatefulPartitionedCall/fourier_embedding/Shape", "StatefulPartitionedCall/brdf_decoder/StatefulPartitionedCall/fourier_embedding/strided_slice_1/stack", "StatefulPartitionedCall/brdf_decoder/StatefulPartitionedCall/fourier_embedding/strided_slice_1/stack_1", "StatefulPartitionedCall/brdf_decoder/StatefulPartitionedCall/fourier_embedding/strided_slice_1/stack_2"], "attr": {"ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "1"}, "T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/brdf_decoder/StatefulPartitionedCall/fourier_embedding/mul", "op": "Mul", "input": ["StatefulPartitionedCall/brdf_decoder/StatefulPartitionedCall/fourier_embedding/ExpandDims", "StatefulPartitionedCall/brdf_decoder/StatefulPartitionedCall/fourier_embedding/mul/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/brdf_decoder/StatefulPartitionedCall/fourier_embedding/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/brdf_decoder/StatefulPartitionedCall/fourier_embedding/mul_1/x", "StatefulPartitionedCall/brdf_decoder/StatefulPartitionedCall/fourier_embedding/strided_slice_1"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/brdf_decoder/StatefulPartitionedCall/fourier_embedding/concat", "op": "ConcatV2", "input": ["StatefulPartitionedCall/brdf_decoder/StatefulPartitionedCall/fourier_embedding/strided_slice", "StatefulPartitionedCall/brdf_decoder/StatefulPartitionedCall/fourier_embedding/mul_1", "StatefulPartitionedCall/brdf_decoder/StatefulPartitionedCall/fourier_embedding/concat/axis"], "attr": {"Tidx": {"type": "DT_INT32"}, "N": {"i": "2"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/brdf_decoder/StatefulPartitionedCall/fourier_embedding/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/brdf_decoder/StatefulPartitionedCall/fourier_embedding/mul", "StatefulPartitionedCall/brdf_decoder/StatefulPartitionedCall/fourier_embedding/concat"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/brdf_decoder/StatefulPartitionedCall/fourier_embedding/add", "op": "AddV2", "input": ["StatefulPartitionedCall/brdf_decoder/StatefulPartitionedCall/fourier_embedding/Reshape", "StatefulPartitionedCall/brdf_decoder/StatefulPartitionedCall/fourier_embedding/add/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/brdf_decoder/StatefulPartitionedCall/fourier_embedding/concat_1", "op": "ConcatV2", "input": ["StatefulPartitionedCall/brdf_decoder/StatefulPartitionedCall/fourier_embedding/Reshape", "StatefulPartitionedCall/brdf_decoder/StatefulPartitionedCall/fourier_embedding/add", "StatefulPartitionedCall/brdf_decoder/StatefulPartitionedCall/fourier_embedding/concat_1/axis"], "attr": {"N": {"i": "2"}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/brdf_decoder/StatefulPartitionedCall/fourier_embedding/Sin", "op": "Sin", "input": ["StatefulPartitionedCall/brdf_decoder/StatefulPartitionedCall/fourier_embedding/concat_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/brdf_decoder/StatefulPartitionedCall/fourier_embedding/concat_2", "op": "ConcatV2", "input": ["input_1", "StatefulPartitionedCall/brdf_decoder/StatefulPartitionedCall/fourier_embedding/Sin", "StatefulPartitionedCall/brdf_decoder/StatefulPartitionedCall/fourier_embedding/concat_2/axis"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/brdf_decoder/StatefulPartitionedCall/sequential/dense/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/brdf_decoder/StatefulPartitionedCall/fourier_embedding/concat_2", "StatefulPartitionedCall/brdf_decoder/StatefulPartitionedCall/sequential/dense/MatMul/ReadVariableOp", "StatefulPartitionedCall/brdf_decoder/StatefulPartitionedCall/sequential/dense/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "epsilon": {"f": 0.0}, "num_args": {"i": "1"}, "transpose_b": {"b": false}, "transpose_a": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}}}, {"name": "StatefulPartitionedCall/brdf_decoder/StatefulPartitionedCall/sequential/dense_1/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/brdf_decoder/StatefulPartitionedCall/sequential/dense/Relu", "StatefulPartitionedCall/brdf_decoder/StatefulPartitionedCall/sequential/dense_1/MatMul/ReadVariableOp", "StatefulPartitionedCall/brdf_decoder/StatefulPartitionedCall/sequential/dense_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "transpose_b": {"b": false}, "num_args": {"i": "1"}}}, {"name": "StatefulPartitionedCall/brdf_decoder/StatefulPartitionedCall/sequential/dense_2/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/brdf_decoder/StatefulPartitionedCall/sequential/dense_1/Relu", "StatefulPartitionedCall/brdf_decoder/StatefulPartitionedCall/sequential/dense_2/MatMul/ReadVariableOp", "StatefulPartitionedCall/brdf_decoder/StatefulPartitionedCall/sequential/dense_2/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}}}, {"name": "StatefulPartitionedCall/brdf_decoder/StatefulPartitionedCall/sequential/dense_3/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/brdf_decoder/StatefulPartitionedCall/sequential/dense_2/Relu", "StatefulPartitionedCall/brdf_decoder/StatefulPartitionedCall/sequential/dense_3/MatMul/ReadVariableOp", "StatefulPartitionedCall/brdf_decoder/StatefulPartitionedCall/sequential/dense_3/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "StatefulPartitionedCall/brdf_decoder/StatefulPartitionedCall/sequential/dense_3/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/brdf_decoder/StatefulPartitionedCall/sequential/dense_3/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/brdf_decoder/StatefulPartitionedCall/sequential/dense_3/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 987}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/brdf_decoder/StatefulPartitionedCall/fourier_embedding/ExpandDims/dim", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/brdf_decoder/StatefulPartitionedCall/fourier_embedding/mul/y", "shape": [10, 1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/brdf_decoder/StatefulPartitionedCall/fourier_embedding/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/brdf_decoder/StatefulPartitionedCall/fourier_embedding/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/brdf_decoder/StatefulPartitionedCall/fourier_embedding/strided_slice/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/brdf_decoder/StatefulPartitionedCall/fourier_embedding/mul_1/x", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/brdf_decoder/StatefulPartitionedCall/fourier_embedding/strided_slice_1/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/brdf_decoder/StatefulPartitionedCall/fourier_embedding/strided_slice_1/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/brdf_decoder/StatefulPartitionedCall/fourier_embedding/strided_slice_1/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/brdf_decoder/StatefulPartitionedCall/fourier_embedding/concat/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/brdf_decoder/StatefulPartitionedCall/fourier_embedding/add/y", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/brdf_decoder/StatefulPartitionedCall/fourier_embedding/concat_1/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/brdf_decoder/StatefulPartitionedCall/fourier_embedding/concat_2/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/brdf_decoder/StatefulPartitionedCall/sequential/dense/MatMul/ReadVariableOp", "shape": [84, 32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/brdf_decoder/StatefulPartitionedCall/sequential/dense/BiasAdd/ReadVariableOp", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/brdf_decoder/StatefulPartitionedCall/sequential/dense_3/MatMul/ReadVariableOp", "shape": [32, 7], "dtype": "float32"}, {"name": "StatefulPartitionedCall/brdf_decoder/StatefulPartitionedCall/sequential/dense_1/MatMul/ReadVariableOp", "shape": [32, 32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/brdf_decoder/StatefulPartitionedCall/sequential/dense_1/BiasAdd/ReadVariableOp", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/brdf_decoder/StatefulPartitionedCall/sequential/dense_3/BiasAdd/ReadVariableOp", "shape": [7], "dtype": "float32"}, {"name": "StatefulPartitionedCall/brdf_decoder/StatefulPartitionedCall/sequential/dense_2/MatMul/ReadVariableOp", "shape": [32, 32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/brdf_decoder/StatefulPartitionedCall/sequential/dense_2/BiasAdd/ReadVariableOp", "shape": [32], "dtype": "float32"}]}]}