{"format": "graph-model", "generatedBy": "2.6.0", "convertedBy": "TensorFlow.js Converter v3.15.0", "signature": {"inputs": {"args_1:0": {"name": "args_1:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "3"}, {"size": "128"}]}}, "args_2:0": {"name": "args_2:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "128"}]}}, "args_1_1:0": {"name": "args_1_1:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "3"}, {"size": "128"}]}}, "args_0": {"name": "args_0:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "3"}]}}, "args_2_1:0": {"name": "args_2_1:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "128"}]}}}, "outputs": {"output_1": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "3"}]}}}}, "modelTopology": {"node": [{"name": "args_0", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "3"}]}}}}, {"name": "args_1", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "3"}, {"size": "128"}]}}}}, {"name": "args_1_1", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "3"}, {"size": "128"}]}}}}, {"name": "args_2", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "128"}]}}}}, {"name": "args_2_1", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "128"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/main_network/StatefulPartitionedCall/input_control_node/_17", "op": "NoOp", "input": ["^args_0", "^args_1", "^args_2", "^args_2_1", "^args_1_1"]}, {"name": "StatefulPartitionedCall/main_network/StatefulPartitionedCall/fi_lm_siren/PartitionedCall_3/sine/mul/x", "op": "Const", "input": ["^Func/StatefulPartitionedCall/main_network/StatefulPartitionedCall/input_control_node/_17"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/main_network/StatefulPartitionedCall/fi_lm_siren/PartitionedCall_2/sine/mul/x", "op": "Const", "input": ["^Func/StatefulPartitionedCall/main_network/StatefulPartitionedCall/input_control_node/_17"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/main_network/StatefulPartitionedCall/fi_lm_siren/PartitionedCall_1/sine/mul/x", "op": "Const", "input": ["^Func/StatefulPartitionedCall/main_network/StatefulPartitionedCall/input_control_node/_17"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/main_network/StatefulPartitionedCall/fi_lm_siren/PartitionedCall/sine/mul/x", "op": "Const", "input": ["^Func/StatefulPartitionedCall/main_network/StatefulPartitionedCall/input_control_node/_17"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/main_network/StatefulPartitionedCall/sequential/MainNetwork/Layer0/MatMul/ReadVariableOp", "op": "Const", "input": ["^Func/StatefulPartitionedCall/main_network/StatefulPartitionedCall/input_control_node/_17"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/main_network/StatefulPartitionedCall/sequential/MainNetwork/Layer0/BiasAdd/ReadVariableOp", "op": "Const", "input": ["^Func/StatefulPartitionedCall/main_network/StatefulPartitionedCall/input_control_node/_17"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/main_network/StatefulPartitionedCall/strided_slice/stack", "op": "Const", "input": ["^Func/StatefulPartitionedCall/main_network/StatefulPartitionedCall/input_control_node/_17"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/main_network/StatefulPartitionedCall/strided_slice/stack_1", "op": "Const", "input": ["^Func/StatefulPartitionedCall/main_network/StatefulPartitionedCall/input_control_node/_17"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/main_network/StatefulPartitionedCall/strided_slice/stack_2", "op": "Const", "input": ["^Func/StatefulPartitionedCall/main_network/StatefulPartitionedCall/input_control_node/_17"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/main_network/StatefulPartitionedCall/strided_slice_1/stack", "op": "Const", "input": ["^Func/StatefulPartitionedCall/main_network/StatefulPartitionedCall/input_control_node/_17"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/main_network/StatefulPartitionedCall/strided_slice_1/stack_1", "op": "Const", "input": ["^Func/StatefulPartitionedCall/main_network/StatefulPartitionedCall/input_control_node/_17"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/main_network/StatefulPartitionedCall/strided_slice_1/stack_2", "op": "Const", "input": ["^Func/StatefulPartitionedCall/main_network/StatefulPartitionedCall/input_control_node/_17"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/main_network/StatefulPartitionedCall/sequential_1/MainNetwork/Layer1/MatMul/ReadVariableOp", "op": "Const", "input": ["^Func/StatefulPartitionedCall/main_network/StatefulPartitionedCall/input_control_node/_17"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/main_network/StatefulPartitionedCall/sequential_1/MainNetwork/Layer1/BiasAdd/ReadVariableOp", "op": "Const", "input": ["^Func/StatefulPartitionedCall/main_network/StatefulPartitionedCall/input_control_node/_17"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/main_network/StatefulPartitionedCall/strided_slice_2/stack", "op": "Const", "input": ["^Func/StatefulPartitionedCall/main_network/StatefulPartitionedCall/input_control_node/_17"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/main_network/StatefulPartitionedCall/strided_slice_2/stack_1", "op": "Const", "input": ["^Func/StatefulPartitionedCall/main_network/StatefulPartitionedCall/input_control_node/_17"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/main_network/StatefulPartitionedCall/strided_slice_2/stack_2", "op": "Const", "input": ["^Func/StatefulPartitionedCall/main_network/StatefulPartitionedCall/input_control_node/_17"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/main_network/StatefulPartitionedCall/strided_slice_3/stack", "op": "Const", "input": ["^Func/StatefulPartitionedCall/main_network/StatefulPartitionedCall/input_control_node/_17"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/main_network/StatefulPartitionedCall/strided_slice_3/stack_1", "op": "Const", "input": ["^Func/StatefulPartitionedCall/main_network/StatefulPartitionedCall/input_control_node/_17"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/main_network/StatefulPartitionedCall/strided_slice_3/stack_2", "op": "Const", "input": ["^Func/StatefulPartitionedCall/main_network/StatefulPartitionedCall/input_control_node/_17"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/main_network/StatefulPartitionedCall/sequential_2/MainNetwork/Layer2/MatMul/ReadVariableOp", "op": "Const", "input": ["^Func/StatefulPartitionedCall/main_network/StatefulPartitionedCall/input_control_node/_17"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/main_network/StatefulPartitionedCall/sequential_2/MainNetwork/Layer2/BiasAdd/ReadVariableOp", "op": "Const", "input": ["^Func/StatefulPartitionedCall/main_network/StatefulPartitionedCall/input_control_node/_17"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/main_network/StatefulPartitionedCall/input/_20", "op": "Identity", "input": ["args_1_1", "^Func/StatefulPartitionedCall/main_network/StatefulPartitionedCall/input_control_node/_17"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/main_network/StatefulPartitionedCall/strided_slice_4/stack", "op": "Const", "input": ["^Func/StatefulPartitionedCall/main_network/StatefulPartitionedCall/input_control_node/_17"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/main_network/StatefulPartitionedCall/strided_slice_4/stack_1", "op": "Const", "input": ["^Func/StatefulPartitionedCall/main_network/StatefulPartitionedCall/input_control_node/_17"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/main_network/StatefulPartitionedCall/strided_slice_4/stack_2", "op": "Const", "input": ["^Func/StatefulPartitionedCall/main_network/StatefulPartitionedCall/input_control_node/_17"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "Func/StatefulPartitionedCall/main_network/StatefulPartitionedCall/input/_19", "op": "Identity", "input": ["args_1", "^Func/StatefulPartitionedCall/main_network/StatefulPartitionedCall/input_control_node/_17"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/main_network/StatefulPartitionedCall/sequential_4/MainNetwork/Output/BiasAdd/ReadVariableOp", "op": "Const", "input": ["^Func/StatefulPartitionedCall/main_network/StatefulPartitionedCall/input_control_node/_17"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/main_network/StatefulPartitionedCall/strided_slice_5/stack", "op": "Const", "input": ["^Func/StatefulPartitionedCall/main_network/StatefulPartitionedCall/input_control_node/_17"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/main_network/StatefulPartitionedCall/strided_slice_5/stack_1", "op": "Const", "input": ["^Func/StatefulPartitionedCall/main_network/StatefulPartitionedCall/input_control_node/_17"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/main_network/StatefulPartitionedCall/strided_slice_5/stack_2", "op": "Const", "input": ["^Func/StatefulPartitionedCall/main_network/StatefulPartitionedCall/input_control_node/_17"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/main_network/StatefulPartitionedCall/sequential_3/MainNetwork/Conditional/MatMul/ReadVariableOp", "op": "Const", "input": ["^Func/StatefulPartitionedCall/main_network/StatefulPartitionedCall/input_control_node/_17"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/main_network/StatefulPartitionedCall/sequential_3/MainNetwork/Conditional/BiasAdd/ReadVariableOp", "op": "Const", "input": ["^Func/StatefulPartitionedCall/main_network/StatefulPartitionedCall/input_control_node/_17"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/main_network/StatefulPartitionedCall/sequential_4/MainNetwork/Output/MatMul/ReadVariableOp", "op": "Const", "input": ["^Func/StatefulPartitionedCall/main_network/StatefulPartitionedCall/input_control_node/_17"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/main_network/StatefulPartitionedCall/sequential/MainNetwork/Layer0/BiasAdd", "op": "_FusedMatMul", "input": ["args_0", "StatefulPartitionedCall/main_network/StatefulPartitionedCall/sequential/MainNetwork/Layer0/MatMul/ReadVariableOp", "StatefulPartitionedCall/main_network/StatefulPartitionedCall/sequential/MainNetwork/Layer0/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"epsilon": {"f": 0.0}, "transpose_a": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}}}, {"name": "StatefulPartitionedCall/main_network/StatefulPartitionedCall/strided_slice", "op": "StridedSlice", "input": ["Func/StatefulPartitionedCall/main_network/StatefulPartitionedCall/input/_20", "StatefulPartitionedCall/main_network/StatefulPartitionedCall/strided_slice/stack", "StatefulPartitionedCall/main_network/StatefulPartitionedCall/strided_slice/stack_1", "StatefulPartitionedCall/main_network/StatefulPartitionedCall/strided_slice/stack_2"], "attr": {"end_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "T": {"type": "DT_FLOAT"}, "begin_mask": {"i": "1"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "2"}}}, {"name": "StatefulPartitionedCall/main_network/StatefulPartitionedCall/strided_slice_2", "op": "StridedSlice", "input": ["Func/StatefulPartitionedCall/main_network/StatefulPartitionedCall/input/_20", "StatefulPartitionedCall/main_network/StatefulPartitionedCall/strided_slice_2/stack", "StatefulPartitionedCall/main_network/StatefulPartitionedCall/strided_slice_2/stack_1", "StatefulPartitionedCall/main_network/StatefulPartitionedCall/strided_slice_2/stack_2"], "attr": {"Index": {"type": "DT_INT32"}, "begin_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "shrink_axis_mask": {"i": "2"}, "new_axis_mask": {"i": "0"}, "T": {"type": "DT_FLOAT"}, "end_mask": {"i": "1"}}}, {"name": "StatefulPartitionedCall/main_network/StatefulPartitionedCall/strided_slice_4", "op": "StridedSlice", "input": ["Func/StatefulPartitionedCall/main_network/StatefulPartitionedCall/input/_20", "StatefulPartitionedCall/main_network/StatefulPartitionedCall/strided_slice_4/stack", "StatefulPartitionedCall/main_network/StatefulPartitionedCall/strided_slice_4/stack_1", "StatefulPartitionedCall/main_network/StatefulPartitionedCall/strided_slice_4/stack_2"], "attr": {"begin_mask": {"i": "1"}, "new_axis_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "shrink_axis_mask": {"i": "2"}, "Index": {"type": "DT_INT32"}, "end_mask": {"i": "1"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/main_network/StatefulPartitionedCall/strided_slice_1", "op": "StridedSlice", "input": ["Func/StatefulPartitionedCall/main_network/StatefulPartitionedCall/input/_19", "StatefulPartitionedCall/main_network/StatefulPartitionedCall/strided_slice_1/stack", "StatefulPartitionedCall/main_network/StatefulPartitionedCall/strided_slice_1/stack_1", "StatefulPartitionedCall/main_network/StatefulPartitionedCall/strided_slice_1/stack_2"], "attr": {"begin_mask": {"i": "1"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "T": {"type": "DT_FLOAT"}, "shrink_axis_mask": {"i": "2"}}}, {"name": "StatefulPartitionedCall/main_network/StatefulPartitionedCall/strided_slice_3", "op": "StridedSlice", "input": ["Func/StatefulPartitionedCall/main_network/StatefulPartitionedCall/input/_19", "StatefulPartitionedCall/main_network/StatefulPartitionedCall/strided_slice_3/stack", "StatefulPartitionedCall/main_network/StatefulPartitionedCall/strided_slice_3/stack_1", "StatefulPartitionedCall/main_network/StatefulPartitionedCall/strided_slice_3/stack_2"], "attr": {"shrink_axis_mask": {"i": "2"}, "end_mask": {"i": "1"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "new_axis_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "1"}}}, {"name": "StatefulPartitionedCall/main_network/StatefulPartitionedCall/strided_slice_5", "op": "StridedSlice", "input": ["Func/StatefulPartitionedCall/main_network/StatefulPartitionedCall/input/_19", "StatefulPartitionedCall/main_network/StatefulPartitionedCall/strided_slice_5/stack", "StatefulPartitionedCall/main_network/StatefulPartitionedCall/strided_slice_5/stack_1", "StatefulPartitionedCall/main_network/StatefulPartitionedCall/strided_slice_5/stack_2"], "attr": {"new_axis_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "T": {"type": "DT_FLOAT"}, "Index": {"type": "DT_INT32"}, "end_mask": {"i": "1"}, "shrink_axis_mask": {"i": "2"}, "begin_mask": {"i": "1"}}}, {"name": "StatefulPartitionedCall/main_network/StatefulPartitionedCall/fi_lm_siren/PartitionedCall/mul", "op": "Mul", "input": ["StatefulPartitionedCall/main_network/StatefulPartitionedCall/sequential/MainNetwork/Layer0/BiasAdd", "StatefulPartitionedCall/main_network/StatefulPartitionedCall/strided_slice"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/main_network/StatefulPartitionedCall/fi_lm_siren/PartitionedCall/add", "op": "AddV2", "input": ["StatefulPartitionedCall/main_network/StatefulPartitionedCall/fi_lm_siren/PartitionedCall/mul", "StatefulPartitionedCall/main_network/StatefulPartitionedCall/strided_slice_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/main_network/StatefulPartitionedCall/fi_lm_siren/PartitionedCall/sine/mul", "op": "Mul", "input": ["StatefulPartitionedCall/main_network/StatefulPartitionedCall/fi_lm_siren/PartitionedCall/sine/mul/x", "StatefulPartitionedCall/main_network/StatefulPartitionedCall/fi_lm_siren/PartitionedCall/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/main_network/StatefulPartitionedCall/fi_lm_siren/PartitionedCall/sine/Sin", "op": "Sin", "input": ["StatefulPartitionedCall/main_network/StatefulPartitionedCall/fi_lm_siren/PartitionedCall/sine/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/main_network/StatefulPartitionedCall/sequential_1/MainNetwork/Layer1/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/main_network/StatefulPartitionedCall/fi_lm_siren/PartitionedCall/sine/Sin", "StatefulPartitionedCall/main_network/StatefulPartitionedCall/sequential_1/MainNetwork/Layer1/MatMul/ReadVariableOp", "StatefulPartitionedCall/main_network/StatefulPartitionedCall/sequential_1/MainNetwork/Layer1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "transpose_a": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}}}, {"name": "StatefulPartitionedCall/main_network/StatefulPartitionedCall/fi_lm_siren/PartitionedCall_1/mul", "op": "Mul", "input": ["StatefulPartitionedCall/main_network/StatefulPartitionedCall/sequential_1/MainNetwork/Layer1/BiasAdd", "StatefulPartitionedCall/main_network/StatefulPartitionedCall/strided_slice_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/main_network/StatefulPartitionedCall/fi_lm_siren/PartitionedCall_1/add", "op": "AddV2", "input": ["StatefulPartitionedCall/main_network/StatefulPartitionedCall/fi_lm_siren/PartitionedCall_1/mul", "StatefulPartitionedCall/main_network/StatefulPartitionedCall/strided_slice_3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/main_network/StatefulPartitionedCall/fi_lm_siren/PartitionedCall_1/sine/mul", "op": "Mul", "input": ["StatefulPartitionedCall/main_network/StatefulPartitionedCall/fi_lm_siren/PartitionedCall_1/sine/mul/x", "StatefulPartitionedCall/main_network/StatefulPartitionedCall/fi_lm_siren/PartitionedCall_1/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/main_network/StatefulPartitionedCall/fi_lm_siren/PartitionedCall_1/sine/Sin", "op": "Sin", "input": ["StatefulPartitionedCall/main_network/StatefulPartitionedCall/fi_lm_siren/PartitionedCall_1/sine/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/main_network/StatefulPartitionedCall/sequential_2/MainNetwork/Layer2/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/main_network/StatefulPartitionedCall/fi_lm_siren/PartitionedCall_1/sine/Sin", "StatefulPartitionedCall/main_network/StatefulPartitionedCall/sequential_2/MainNetwork/Layer2/MatMul/ReadVariableOp", "StatefulPartitionedCall/main_network/StatefulPartitionedCall/sequential_2/MainNetwork/Layer2/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "epsilon": {"f": 0.0}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}}}, {"name": "StatefulPartitionedCall/main_network/StatefulPartitionedCall/fi_lm_siren/PartitionedCall_2/mul", "op": "Mul", "input": ["StatefulPartitionedCall/main_network/StatefulPartitionedCall/sequential_2/MainNetwork/Layer2/BiasAdd", "StatefulPartitionedCall/main_network/StatefulPartitionedCall/strided_slice_4"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/main_network/StatefulPartitionedCall/fi_lm_siren/PartitionedCall_2/add", "op": "AddV2", "input": ["StatefulPartitionedCall/main_network/StatefulPartitionedCall/fi_lm_siren/PartitionedCall_2/mul", "StatefulPartitionedCall/main_network/StatefulPartitionedCall/strided_slice_5"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/main_network/StatefulPartitionedCall/fi_lm_siren/PartitionedCall_2/sine/mul", "op": "Mul", "input": ["StatefulPartitionedCall/main_network/StatefulPartitionedCall/fi_lm_siren/PartitionedCall_2/sine/mul/x", "StatefulPartitionedCall/main_network/StatefulPartitionedCall/fi_lm_siren/PartitionedCall_2/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/main_network/StatefulPartitionedCall/fi_lm_siren/PartitionedCall_2/sine/Sin", "op": "Sin", "input": ["StatefulPartitionedCall/main_network/StatefulPartitionedCall/fi_lm_siren/PartitionedCall_2/sine/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/main_network/StatefulPartitionedCall/sequential_3/MainNetwork/Conditional/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/main_network/StatefulPartitionedCall/fi_lm_siren/PartitionedCall_2/sine/Sin", "StatefulPartitionedCall/main_network/StatefulPartitionedCall/sequential_3/MainNetwork/Conditional/MatMul/ReadVariableOp", "StatefulPartitionedCall/main_network/StatefulPartitionedCall/sequential_3/MainNetwork/Conditional/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "T": {"type": "DT_FLOAT"}, "epsilon": {"f": 0.0}}}, {"name": "StatefulPartitionedCall/main_network/StatefulPartitionedCall/fi_lm_siren/PartitionedCall_3/mul", "op": "Mul", "input": ["StatefulPartitionedCall/main_network/StatefulPartitionedCall/sequential_3/MainNetwork/Conditional/BiasAdd", "args_2_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/main_network/StatefulPartitionedCall/fi_lm_siren/PartitionedCall_3/add", "op": "AddV2", "input": ["StatefulPartitionedCall/main_network/StatefulPartitionedCall/fi_lm_siren/PartitionedCall_3/mul", "args_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/main_network/StatefulPartitionedCall/fi_lm_siren/PartitionedCall_3/sine/mul", "op": "Mul", "input": ["StatefulPartitionedCall/main_network/StatefulPartitionedCall/fi_lm_siren/PartitionedCall_3/sine/mul/x", "StatefulPartitionedCall/main_network/StatefulPartitionedCall/fi_lm_siren/PartitionedCall_3/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/main_network/StatefulPartitionedCall/fi_lm_siren/PartitionedCall_3/sine/Sin", "op": "Sin", "input": ["StatefulPartitionedCall/main_network/StatefulPartitionedCall/fi_lm_siren/PartitionedCall_3/sine/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/main_network/StatefulPartitionedCall/sequential_4/MainNetwork/Output/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/main_network/StatefulPartitionedCall/fi_lm_siren/PartitionedCall_3/sine/Sin", "StatefulPartitionedCall/main_network/StatefulPartitionedCall/sequential_4/MainNetwork/Output/MatMul/ReadVariableOp", "StatefulPartitionedCall/main_network/StatefulPartitionedCall/sequential_4/MainNetwork/Output/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}}}, {"name": "StatefulPartitionedCall/main_network/StatefulPartitionedCall/sequential_4/MainNetwork/Output/sub", "op": "Expm1", "input": ["StatefulPartitionedCall/main_network/StatefulPartitionedCall/sequential_4/MainNetwork/Output/Relu"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/main_network/StatefulPartitionedCall/sequential_4/MainNetwork/Output/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 987}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/main_network/StatefulPartitionedCall/fi_lm_siren/PartitionedCall_3/sine/mul/x", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/main_network/StatefulPartitionedCall/fi_lm_siren/PartitionedCall_2/sine/mul/x", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/main_network/StatefulPartitionedCall/fi_lm_siren/PartitionedCall_1/sine/mul/x", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/main_network/StatefulPartitionedCall/fi_lm_siren/PartitionedCall/sine/mul/x", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/main_network/StatefulPartitionedCall/sequential/MainNetwork/Layer0/MatMul/ReadVariableOp", "shape": [3, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/main_network/StatefulPartitionedCall/sequential/MainNetwork/Layer0/BiasAdd/ReadVariableOp", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/main_network/StatefulPartitionedCall/strided_slice/stack", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/main_network/StatefulPartitionedCall/strided_slice/stack_1", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/main_network/StatefulPartitionedCall/strided_slice/stack_2", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/main_network/StatefulPartitionedCall/strided_slice_1/stack", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/main_network/StatefulPartitionedCall/strided_slice_1/stack_1", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/main_network/StatefulPartitionedCall/strided_slice_1/stack_2", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/main_network/StatefulPartitionedCall/sequential_1/MainNetwork/Layer1/MatMul/ReadVariableOp", "shape": [128, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/main_network/StatefulPartitionedCall/sequential_1/MainNetwork/Layer1/BiasAdd/ReadVariableOp", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/main_network/StatefulPartitionedCall/strided_slice_2/stack", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/main_network/StatefulPartitionedCall/strided_slice_2/stack_1", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/main_network/StatefulPartitionedCall/strided_slice_2/stack_2", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/main_network/StatefulPartitionedCall/strided_slice_3/stack", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/main_network/StatefulPartitionedCall/strided_slice_3/stack_1", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/main_network/StatefulPartitionedCall/strided_slice_3/stack_2", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/main_network/StatefulPartitionedCall/sequential_2/MainNetwork/Layer2/MatMul/ReadVariableOp", "shape": [128, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/main_network/StatefulPartitionedCall/sequential_2/MainNetwork/Layer2/BiasAdd/ReadVariableOp", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/main_network/StatefulPartitionedCall/strided_slice_4/stack", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/main_network/StatefulPartitionedCall/strided_slice_4/stack_1", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/main_network/StatefulPartitionedCall/strided_slice_4/stack_2", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/main_network/StatefulPartitionedCall/sequential_4/MainNetwork/Output/BiasAdd/ReadVariableOp", "shape": [3], "dtype": "float32"}, {"name": "StatefulPartitionedCall/main_network/StatefulPartitionedCall/strided_slice_5/stack", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/main_network/StatefulPartitionedCall/strided_slice_5/stack_1", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/main_network/StatefulPartitionedCall/strided_slice_5/stack_2", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/main_network/StatefulPartitionedCall/sequential_3/MainNetwork/Conditional/MatMul/ReadVariableOp", "shape": [128, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/main_network/StatefulPartitionedCall/sequential_3/MainNetwork/Conditional/BiasAdd/ReadVariableOp", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/main_network/StatefulPartitionedCall/sequential_4/MainNetwork/Output/MatMul/ReadVariableOp", "shape": [128, 3], "dtype": "float32"}]}]}