{"format": "graph-model", "generatedBy": "2.6.0", "convertedBy": "TensorFlow.js Converter v3.15.0", "signature": {"inputs": {"input_1": {"name": "input_1:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "128"}]}}}, "outputs": {"Identity_1:0": {"name": "Identity_1:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "3"}, {"size": "128"}]}}, "Identity:0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "3"}, {"size": "128"}]}}}}, "modelTopology": {"node": [{"name": "input_1", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "128"}]}}}}, {"name": "StatefulPartitionedCall/fi_lm_mapping_net/StatefulPartitionedCall/strided_slice/stack", "op": "Const", "input": ["^input_1"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/fi_lm_mapping_net/StatefulPartitionedCall/strided_slice/stack_1", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/fi_lm_mapping_net/StatefulPartitionedCall/strided_slice/stack_2", "op": "Const", "input": ["^input_1"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/fi_lm_mapping_net/StatefulPartitionedCall/sequential_5/reshape/strided_slice/stack", "op": "Const", "input": ["^input_1"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/fi_lm_mapping_net/StatefulPartitionedCall/sequential_5/reshape/strided_slice/stack_1", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/fi_lm_mapping_net/StatefulPartitionedCall/sequential_5/reshape/strided_slice/stack_2", "op": "Const", "input": ["^input_1"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/fi_lm_mapping_net/StatefulPartitionedCall/sequential_5/reshape/Reshape/shape/1", "op": "Const", "input": ["^input_1"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/fi_lm_mapping_net/StatefulPartitionedCall/sequential_5/reshape/Reshape/shape/2", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/fi_lm_mapping_net/StatefulPartitionedCall/sequential_5/reshape/Reshape/shape/3", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/fi_lm_mapping_net/StatefulPartitionedCall/strided_slice_1/stack", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/fi_lm_mapping_net/StatefulPartitionedCall/strided_slice_1/stack_1", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/fi_lm_mapping_net/StatefulPartitionedCall/strided_slice_1/stack_2", "op": "Const", "input": ["^input_1"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/fi_lm_mapping_net/StatefulPartitionedCall/sequential_5/MappingNetwork/Final/BiasAdd/ReadVariableOp", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "768"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/fi_lm_mapping_net/StatefulPartitionedCall/sequential_5/MappingNetwork/Final/MatMul/ReadVariableOp", "op": "Const", "input": ["^input_1"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "768"}]}}}}}, {"name": "StatefulPartitionedCall/fi_lm_mapping_net/StatefulPartitionedCall/sequential_5/MappingNetwork/Layer_0/BiasAdd/ReadVariableOp", "op": "Const", "input": ["^input_1"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/fi_lm_mapping_net/StatefulPartitionedCall/sequential_5/MappingNetwork/Layer_0/MatMul/ReadVariableOp", "op": "Const", "input": ["^input_1"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/fi_lm_mapping_net/StatefulPartitionedCall/sequential_5/MappingNetwork/Layer_1/BiasAdd/ReadVariableOp", "op": "Const", "input": ["^input_1"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/fi_lm_mapping_net/StatefulPartitionedCall/sequential_5/MappingNetwork/Layer_1/MatMul/ReadVariableOp", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/fi_lm_mapping_net/StatefulPartitionedCall/sequential_5/MappingNetwork/Layer_0/Elu", "op": "_FusedMatMul", "input": ["input_1", "StatefulPartitionedCall/fi_lm_mapping_net/StatefulPartitionedCall/sequential_5/MappingNetwork/Layer_0/MatMul/ReadVariableOp", "StatefulPartitionedCall/fi_lm_mapping_net/StatefulPartitionedCall/sequential_5/MappingNetwork/Layer_0/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "RWx1"]}}, "transpose_b": {"b": false}, "transpose_a": {"b": false}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/fi_lm_mapping_net/StatefulPartitionedCall/output_control_node/_20", "op": "NoOp", "input": ["^StatefulPartitionedCall/fi_lm_mapping_net/StatefulPartitionedCall/sequential_5/MappingNetwork/Final/BiasAdd/ReadVariableOp", "^StatefulPartitionedCall/fi_lm_mapping_net/StatefulPartitionedCall/sequential_5/MappingNetwork/Final/MatMul/ReadVariableOp", "^StatefulPartitionedCall/fi_lm_mapping_net/StatefulPartitionedCall/sequential_5/MappingNetwork/Layer_0/BiasAdd/ReadVariableOp", "^StatefulPartitionedCall/fi_lm_mapping_net/StatefulPartitionedCall/sequential_5/MappingNetwork/Layer_0/MatMul/ReadVariableOp", "^StatefulPartitionedCall/fi_lm_mapping_net/StatefulPartitionedCall/sequential_5/MappingNetwork/Layer_1/BiasAdd/ReadVariableOp", "^StatefulPartitionedCall/fi_lm_mapping_net/StatefulPartitionedCall/sequential_5/MappingNetwork/Layer_1/MatMul/ReadVariableOp"]}, {"name": "StatefulPartitionedCall/fi_lm_mapping_net/StatefulPartitionedCall/NoOp", "op": "NoOp", "input": ["^StatefulPartitionedCall/fi_lm_mapping_net/StatefulPartitionedCall/sequential_5/MappingNetwork/Final/BiasAdd/ReadVariableOp", "^StatefulPartitionedCall/fi_lm_mapping_net/StatefulPartitionedCall/sequential_5/MappingNetwork/Final/MatMul/ReadVariableOp", "^StatefulPartitionedCall/fi_lm_mapping_net/StatefulPartitionedCall/sequential_5/MappingNetwork/Layer_0/BiasAdd/ReadVariableOp", "^StatefulPartitionedCall/fi_lm_mapping_net/StatefulPartitionedCall/sequential_5/MappingNetwork/Layer_0/MatMul/ReadVariableOp", "^StatefulPartitionedCall/fi_lm_mapping_net/StatefulPartitionedCall/sequential_5/MappingNetwork/Layer_1/BiasAdd/ReadVariableOp", "^StatefulPartitionedCall/fi_lm_mapping_net/StatefulPartitionedCall/sequential_5/MappingNetwork/Layer_1/MatMul/ReadVariableOp"], "attr": {"_acd_function_control_output": {"b": true}}}, {"name": "StatefulPartitionedCall/fi_lm_mapping_net/StatefulPartitionedCall/sequential_5/MappingNetwork/Layer_1/Elu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/fi_lm_mapping_net/StatefulPartitionedCall/sequential_5/MappingNetwork/Layer_0/Elu", "StatefulPartitionedCall/fi_lm_mapping_net/StatefulPartitionedCall/sequential_5/MappingNetwork/Layer_1/MatMul/ReadVariableOp", "StatefulPartitionedCall/fi_lm_mapping_net/StatefulPartitionedCall/sequential_5/MappingNetwork/Layer_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "RWx1"]}}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}, "epsilon": {"f": 0.0}, "num_args": {"i": "1"}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/fi_lm_mapping_net/StatefulPartitionedCall/sequential_5/MappingNetwork/Final/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/fi_lm_mapping_net/StatefulPartitionedCall/sequential_5/MappingNetwork/Layer_1/Elu", "StatefulPartitionedCall/fi_lm_mapping_net/StatefulPartitionedCall/sequential_5/MappingNetwork/Final/MatMul/ReadVariableOp", "StatefulPartitionedCall/fi_lm_mapping_net/StatefulPartitionedCall/sequential_5/MappingNetwork/Final/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "transpose_b": {"b": false}, "transpose_a": {"b": false}}}, {"name": "StatefulPartitionedCall/fi_lm_mapping_net/StatefulPartitionedCall/sequential_5/reshape/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/fi_lm_mapping_net/StatefulPartitionedCall/sequential_5/MappingNetwork/Final/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/fi_lm_mapping_net/StatefulPartitionedCall/sequential_5/reshape/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/fi_lm_mapping_net/StatefulPartitionedCall/sequential_5/reshape/Shape", "StatefulPartitionedCall/fi_lm_mapping_net/StatefulPartitionedCall/sequential_5/reshape/strided_slice/stack", "StatefulPartitionedCall/fi_lm_mapping_net/StatefulPartitionedCall/sequential_5/reshape/strided_slice/stack_1", "StatefulPartitionedCall/fi_lm_mapping_net/StatefulPartitionedCall/sequential_5/reshape/strided_slice/stack_2"], "attr": {"new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}}}, {"name": "StatefulPartitionedCall/fi_lm_mapping_net/StatefulPartitionedCall/sequential_5/reshape/Reshape/shape", "op": "Pack", "input": ["StatefulPartitionedCall/fi_lm_mapping_net/StatefulPartitionedCall/sequential_5/reshape/strided_slice", "StatefulPartitionedCall/fi_lm_mapping_net/StatefulPartitionedCall/sequential_5/reshape/Reshape/shape/1", "StatefulPartitionedCall/fi_lm_mapping_net/StatefulPartitionedCall/sequential_5/reshape/Reshape/shape/2", "StatefulPartitionedCall/fi_lm_mapping_net/StatefulPartitionedCall/sequential_5/reshape/Reshape/shape/3"], "attr": {"N": {"i": "4"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/fi_lm_mapping_net/StatefulPartitionedCall/sequential_5/reshape/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/fi_lm_mapping_net/StatefulPartitionedCall/sequential_5/MappingNetwork/Final/BiasAdd", "StatefulPartitionedCall/fi_lm_mapping_net/StatefulPartitionedCall/sequential_5/reshape/Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/fi_lm_mapping_net/StatefulPartitionedCall/strided_slice_1", "op": "StridedSlice", "input": ["StatefulPartitionedCall/fi_lm_mapping_net/StatefulPartitionedCall/sequential_5/reshape/Reshape", "StatefulPartitionedCall/fi_lm_mapping_net/StatefulPartitionedCall/strided_slice_1/stack", "StatefulPartitionedCall/fi_lm_mapping_net/StatefulPartitionedCall/strided_slice_1/stack_1", "StatefulPartitionedCall/fi_lm_mapping_net/StatefulPartitionedCall/strided_slice_1/stack_2"], "attr": {"new_axis_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "end_mask": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "1"}, "shrink_axis_mask": {"i": "2"}}}, {"name": "StatefulPartitionedCall/fi_lm_mapping_net/StatefulPartitionedCall/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/fi_lm_mapping_net/StatefulPartitionedCall/sequential_5/reshape/Reshape", "StatefulPartitionedCall/fi_lm_mapping_net/StatefulPartitionedCall/strided_slice/stack", "StatefulPartitionedCall/fi_lm_mapping_net/StatefulPartitionedCall/strided_slice/stack_1", "StatefulPartitionedCall/fi_lm_mapping_net/StatefulPartitionedCall/strided_slice/stack_2"], "attr": {"Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "2"}, "ellipsis_mask": {"i": "0"}, "end_mask": {"i": "1"}, "new_axis_mask": {"i": "0"}, "T": {"type": "DT_FLOAT"}, "begin_mask": {"i": "1"}}}, {"name": "Identity_1", "op": "Identity", "input": ["StatefulPartitionedCall/fi_lm_mapping_net/StatefulPartitionedCall/strided_slice_1", "^Func/StatefulPartitionedCall/fi_lm_mapping_net/StatefulPartitionedCall/output_control_node/_20", "^StatefulPartitionedCall/fi_lm_mapping_net/StatefulPartitionedCall/NoOp"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/fi_lm_mapping_net/StatefulPartitionedCall/strided_slice", "^Func/StatefulPartitionedCall/fi_lm_mapping_net/StatefulPartitionedCall/output_control_node/_20", "^StatefulPartitionedCall/fi_lm_mapping_net/StatefulPartitionedCall/NoOp"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 987}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/fi_lm_mapping_net/StatefulPartitionedCall/strided_slice/stack", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/fi_lm_mapping_net/StatefulPartitionedCall/strided_slice/stack_1", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/fi_lm_mapping_net/StatefulPartitionedCall/strided_slice/stack_2", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/fi_lm_mapping_net/StatefulPartitionedCall/sequential_5/reshape/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/fi_lm_mapping_net/StatefulPartitionedCall/sequential_5/reshape/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/fi_lm_mapping_net/StatefulPartitionedCall/sequential_5/reshape/strided_slice/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/fi_lm_mapping_net/StatefulPartitionedCall/sequential_5/reshape/Reshape/shape/1", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/fi_lm_mapping_net/StatefulPartitionedCall/sequential_5/reshape/Reshape/shape/2", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/fi_lm_mapping_net/StatefulPartitionedCall/sequential_5/reshape/Reshape/shape/3", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/fi_lm_mapping_net/StatefulPartitionedCall/strided_slice_1/stack", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/fi_lm_mapping_net/StatefulPartitionedCall/strided_slice_1/stack_1", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/fi_lm_mapping_net/StatefulPartitionedCall/strided_slice_1/stack_2", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/fi_lm_mapping_net/StatefulPartitionedCall/sequential_5/MappingNetwork/Final/BiasAdd/ReadVariableOp", "shape": [768], "dtype": "float32"}, {"name": "StatefulPartitionedCall/fi_lm_mapping_net/StatefulPartitionedCall/sequential_5/MappingNetwork/Final/MatMul/ReadVariableOp", "shape": [128, 768], "dtype": "float32"}, {"name": "StatefulPartitionedCall/fi_lm_mapping_net/StatefulPartitionedCall/sequential_5/MappingNetwork/Layer_0/BiasAdd/ReadVariableOp", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/fi_lm_mapping_net/StatefulPartitionedCall/sequential_5/MappingNetwork/Layer_0/MatMul/ReadVariableOp", "shape": [128, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/fi_lm_mapping_net/StatefulPartitionedCall/sequential_5/MappingNetwork/Layer_1/BiasAdd/ReadVariableOp", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/fi_lm_mapping_net/StatefulPartitionedCall/sequential_5/MappingNetwork/Layer_1/MatMul/ReadVariableOp", "shape": [128, 128], "dtype": "float32"}]}]}