{"format": "graph-model", "generatedBy": "2.6.0", "convertedBy": "TensorFlow.js Converter v3.15.0", "signature": {"inputs": {"input_1": {"name": "input_1:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}]}}}, "outputs": {"Identity_1:0": {"name": "Identity_1:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "128"}]}}, "Identity:0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "128"}]}}}}, "modelTopology": {"node": [{"name": "input_1", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "1"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/conditional_mapping_net/StatefulPartitionedCall/fourier_embedding/Shape", "op": "Shape", "input": ["input_1"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/conditional_mapping_net/StatefulPartitionedCall/strided_slice/stack", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/conditional_mapping_net/StatefulPartitionedCall/strided_slice/stack_1", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/conditional_mapping_net/StatefulPartitionedCall/strided_slice/stack_2", "op": "Const", "input": ["^input_1"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/conditional_mapping_net/StatefulPartitionedCall/fourier_embedding/ExpandDims/dim", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/conditional_mapping_net/StatefulPartitionedCall/fourier_embedding/mul/y", "op": "Const", "input": ["^input_1"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2"}, {"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/conditional_mapping_net/StatefulPartitionedCall/fourier_embedding/strided_slice/stack", "op": "Const", "input": ["^input_1"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/conditional_mapping_net/StatefulPartitionedCall/fourier_embedding/strided_slice/stack_1", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/conditional_mapping_net/StatefulPartitionedCall/fourier_embedding/strided_slice/stack_2", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/conditional_mapping_net/StatefulPartitionedCall/fourier_embedding/mul_1/x", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/conditional_mapping_net/StatefulPartitionedCall/fourier_embedding/strided_slice_1/stack", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/conditional_mapping_net/StatefulPartitionedCall/fourier_embedding/strided_slice_1/stack_1", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/conditional_mapping_net/StatefulPartitionedCall/fourier_embedding/strided_slice_1/stack_2", "op": "Const", "input": ["^input_1"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/conditional_mapping_net/StatefulPartitionedCall/fourier_embedding/concat/axis", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/conditional_mapping_net/StatefulPartitionedCall/fourier_embedding/add/y", "op": "Const", "input": ["^input_1"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/conditional_mapping_net/StatefulPartitionedCall/fourier_embedding/concat_1/axis", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/conditional_mapping_net/StatefulPartitionedCall/fourier_embedding/concat_2/axis", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/conditional_mapping_net/StatefulPartitionedCall/sequential_6/reshape_1/strided_slice/stack", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/conditional_mapping_net/StatefulPartitionedCall/sequential_6/reshape_1/strided_slice/stack_1", "op": "Const", "input": ["^input_1"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/conditional_mapping_net/StatefulPartitionedCall/sequential_6/reshape_1/strided_slice/stack_2", "op": "Const", "input": ["^input_1"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/conditional_mapping_net/StatefulPartitionedCall/sequential_6/reshape_1/Reshape/shape/1", "op": "Const", "input": ["^input_1"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/conditional_mapping_net/StatefulPartitionedCall/sequential_6/reshape_1/Reshape/shape/2", "op": "Const", "input": ["^input_1"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/conditional_mapping_net/StatefulPartitionedCall/strided_slice_1/stack", "op": "Const", "input": ["^input_1"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/conditional_mapping_net/StatefulPartitionedCall/strided_slice_1/stack_1", "op": "Const", "input": ["^input_1"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/conditional_mapping_net/StatefulPartitionedCall/strided_slice_1/stack_2", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/conditional_mapping_net/StatefulPartitionedCall/sequential_6/ConditionalNetwork/Dense1/BiasAdd/ReadVariableOp", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/conditional_mapping_net/StatefulPartitionedCall/sequential_6/ConditionalNetwork/Dense1/MatMul/ReadVariableOp", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/conditional_mapping_net/StatefulPartitionedCall/sequential_6/ConditionalNetwork/DenseFinal/BiasAdd/ReadVariableOp", "op": "Const", "input": ["^input_1"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}}}, {"name": "StatefulPartitionedCall/conditional_mapping_net/StatefulPartitionedCall/sequential_6/ConditionalNetwork/DenseFinal/MatMul/ReadVariableOp", "op": "Const", "input": ["^input_1"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}, {"size": "256"}]}}}}}, {"name": "StatefulPartitionedCall/conditional_mapping_net/StatefulPartitionedCall/fourier_embedding/ExpandDims", "op": "ExpandDims", "input": ["input_1", "StatefulPartitionedCall/conditional_mapping_net/StatefulPartitionedCall/fourier_embedding/ExpandDims/dim"], "attr": {"T": {"type": "DT_FLOAT"}, "Tdim": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/conditional_mapping_net/StatefulPartitionedCall/fourier_embedding/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/conditional_mapping_net/StatefulPartitionedCall/fourier_embedding/Shape", "StatefulPartitionedCall/conditional_mapping_net/StatefulPartitionedCall/fourier_embedding/strided_slice/stack", "StatefulPartitionedCall/conditional_mapping_net/StatefulPartitionedCall/fourier_embedding/strided_slice/stack_1", "StatefulPartitionedCall/conditional_mapping_net/StatefulPartitionedCall/fourier_embedding/strided_slice/stack_2"], "attr": {"end_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "1"}, "new_axis_mask": {"i": "0"}, "shrink_axis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/conditional_mapping_net/StatefulPartitionedCall/fourier_embedding/strided_slice_1", "op": "StridedSlice", "input": ["StatefulPartitionedCall/conditional_mapping_net/StatefulPartitionedCall/fourier_embedding/Shape", "StatefulPartitionedCall/conditional_mapping_net/StatefulPartitionedCall/fourier_embedding/strided_slice_1/stack", "StatefulPartitionedCall/conditional_mapping_net/StatefulPartitionedCall/fourier_embedding/strided_slice_1/stack_1", "StatefulPartitionedCall/conditional_mapping_net/StatefulPartitionedCall/fourier_embedding/strided_slice_1/stack_2"], "attr": {"T": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/conditional_mapping_net/StatefulPartitionedCall/NoOp", "op": "NoOp", "input": ["^StatefulPartitionedCall/conditional_mapping_net/StatefulPartitionedCall/sequential_6/ConditionalNetwork/Dense1/BiasAdd/ReadVariableOp", "^StatefulPartitionedCall/conditional_mapping_net/StatefulPartitionedCall/sequential_6/ConditionalNetwork/Dense1/MatMul/ReadVariableOp", "^StatefulPartitionedCall/conditional_mapping_net/StatefulPartitionedCall/sequential_6/ConditionalNetwork/DenseFinal/BiasAdd/ReadVariableOp", "^StatefulPartitionedCall/conditional_mapping_net/StatefulPartitionedCall/sequential_6/ConditionalNetwork/DenseFinal/MatMul/ReadVariableOp"], "attr": {"_acd_function_control_output": {"b": true}}}, {"name": "Func/StatefulPartitionedCall/conditional_mapping_net/StatefulPartitionedCall/output_control_node/_16", "op": "NoOp", "input": ["^StatefulPartitionedCall/conditional_mapping_net/StatefulPartitionedCall/sequential_6/ConditionalNetwork/Dense1/BiasAdd/ReadVariableOp", "^StatefulPartitionedCall/conditional_mapping_net/StatefulPartitionedCall/sequential_6/ConditionalNetwork/Dense1/MatMul/ReadVariableOp", "^StatefulPartitionedCall/conditional_mapping_net/StatefulPartitionedCall/sequential_6/ConditionalNetwork/DenseFinal/BiasAdd/ReadVariableOp", "^StatefulPartitionedCall/conditional_mapping_net/StatefulPartitionedCall/sequential_6/ConditionalNetwork/DenseFinal/MatMul/ReadVariableOp"]}, {"name": "StatefulPartitionedCall/conditional_mapping_net/StatefulPartitionedCall/fourier_embedding/mul", "op": "Mul", "input": ["StatefulPartitionedCall/conditional_mapping_net/StatefulPartitionedCall/fourier_embedding/ExpandDims", "StatefulPartitionedCall/conditional_mapping_net/StatefulPartitionedCall/fourier_embedding/mul/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/conditional_mapping_net/StatefulPartitionedCall/fourier_embedding/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/conditional_mapping_net/StatefulPartitionedCall/fourier_embedding/mul_1/x", "StatefulPartitionedCall/conditional_mapping_net/StatefulPartitionedCall/fourier_embedding/strided_slice_1"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/conditional_mapping_net/StatefulPartitionedCall/fourier_embedding/concat", "op": "ConcatV2", "input": ["StatefulPartitionedCall/conditional_mapping_net/StatefulPartitionedCall/fourier_embedding/strided_slice", "StatefulPartitionedCall/conditional_mapping_net/StatefulPartitionedCall/fourier_embedding/mul_1", "StatefulPartitionedCall/conditional_mapping_net/StatefulPartitionedCall/fourier_embedding/concat/axis"], "attr": {"T": {"type": "DT_INT32"}, "Tidx": {"type": "DT_INT32"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/conditional_mapping_net/StatefulPartitionedCall/fourier_embedding/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/conditional_mapping_net/StatefulPartitionedCall/fourier_embedding/mul", "StatefulPartitionedCall/conditional_mapping_net/StatefulPartitionedCall/fourier_embedding/concat"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/conditional_mapping_net/StatefulPartitionedCall/fourier_embedding/add", "op": "AddV2", "input": ["StatefulPartitionedCall/conditional_mapping_net/StatefulPartitionedCall/fourier_embedding/Reshape", "StatefulPartitionedCall/conditional_mapping_net/StatefulPartitionedCall/fourier_embedding/add/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/conditional_mapping_net/StatefulPartitionedCall/fourier_embedding/concat_1", "op": "ConcatV2", "input": ["StatefulPartitionedCall/conditional_mapping_net/StatefulPartitionedCall/fourier_embedding/Reshape", "StatefulPartitionedCall/conditional_mapping_net/StatefulPartitionedCall/fourier_embedding/add", "StatefulPartitionedCall/conditional_mapping_net/StatefulPartitionedCall/fourier_embedding/concat_1/axis"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/conditional_mapping_net/StatefulPartitionedCall/fourier_embedding/Sin", "op": "Sin", "input": ["StatefulPartitionedCall/conditional_mapping_net/StatefulPartitionedCall/fourier_embedding/concat_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/conditional_mapping_net/StatefulPartitionedCall/fourier_embedding/concat_2", "op": "ConcatV2", "input": ["input_1", "StatefulPartitionedCall/conditional_mapping_net/StatefulPartitionedCall/fourier_embedding/Sin", "StatefulPartitionedCall/conditional_mapping_net/StatefulPartitionedCall/fourier_embedding/concat_2/axis"], "attr": {"Tidx": {"type": "DT_INT32"}, "N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/conditional_mapping_net/StatefulPartitionedCall/sequential_6/ConditionalNetwork/Dense1/Elu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/conditional_mapping_net/StatefulPartitionedCall/fourier_embedding/concat_2", "StatefulPartitionedCall/conditional_mapping_net/StatefulPartitionedCall/sequential_6/ConditionalNetwork/Dense1/MatMul/ReadVariableOp", "StatefulPartitionedCall/conditional_mapping_net/StatefulPartitionedCall/sequential_6/ConditionalNetwork/Dense1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "RWx1"]}}, "transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}, "epsilon": {"f": 0.0}, "num_args": {"i": "1"}}}, {"name": "StatefulPartitionedCall/conditional_mapping_net/StatefulPartitionedCall/sequential_6/ConditionalNetwork/DenseFinal/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/conditional_mapping_net/StatefulPartitionedCall/sequential_6/ConditionalNetwork/Dense1/Elu", "StatefulPartitionedCall/conditional_mapping_net/StatefulPartitionedCall/sequential_6/ConditionalNetwork/DenseFinal/MatMul/ReadVariableOp", "StatefulPartitionedCall/conditional_mapping_net/StatefulPartitionedCall/sequential_6/ConditionalNetwork/DenseFinal/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "epsilon": {"f": 0.0}, "transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}}}, {"name": "StatefulPartitionedCall/conditional_mapping_net/StatefulPartitionedCall/sequential_6/reshape_1/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/conditional_mapping_net/StatefulPartitionedCall/sequential_6/ConditionalNetwork/DenseFinal/BiasAdd"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/conditional_mapping_net/StatefulPartitionedCall/sequential_6/reshape_1/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/conditional_mapping_net/StatefulPartitionedCall/sequential_6/reshape_1/Shape", "StatefulPartitionedCall/conditional_mapping_net/StatefulPartitionedCall/sequential_6/reshape_1/strided_slice/stack", "StatefulPartitionedCall/conditional_mapping_net/StatefulPartitionedCall/sequential_6/reshape_1/strided_slice/stack_1", "StatefulPartitionedCall/conditional_mapping_net/StatefulPartitionedCall/sequential_6/reshape_1/strided_slice/stack_2"], "attr": {"T": {"type": "DT_INT32"}, "end_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "begin_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/conditional_mapping_net/StatefulPartitionedCall/sequential_6/reshape_1/Reshape/shape", "op": "Pack", "input": ["StatefulPartitionedCall/conditional_mapping_net/StatefulPartitionedCall/sequential_6/reshape_1/strided_slice", "StatefulPartitionedCall/conditional_mapping_net/StatefulPartitionedCall/sequential_6/reshape_1/Reshape/shape/1", "StatefulPartitionedCall/conditional_mapping_net/StatefulPartitionedCall/sequential_6/reshape_1/Reshape/shape/2"], "attr": {"T": {"type": "DT_INT32"}, "N": {"i": "3"}, "axis": {"i": "0"}}}, {"name": "StatefulPartitionedCall/conditional_mapping_net/StatefulPartitionedCall/sequential_6/reshape_1/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/conditional_mapping_net/StatefulPartitionedCall/sequential_6/ConditionalNetwork/DenseFinal/BiasAdd", "StatefulPartitionedCall/conditional_mapping_net/StatefulPartitionedCall/sequential_6/reshape_1/Reshape/shape"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/conditional_mapping_net/StatefulPartitionedCall/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/conditional_mapping_net/StatefulPartitionedCall/sequential_6/reshape_1/Reshape", "StatefulPartitionedCall/conditional_mapping_net/StatefulPartitionedCall/strided_slice/stack", "StatefulPartitionedCall/conditional_mapping_net/StatefulPartitionedCall/strided_slice/stack_1", "StatefulPartitionedCall/conditional_mapping_net/StatefulPartitionedCall/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "2"}, "new_axis_mask": {"i": "0"}, "T": {"type": "DT_FLOAT"}, "ellipsis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "1"}, "end_mask": {"i": "1"}}}, {"name": "StatefulPartitionedCall/conditional_mapping_net/StatefulPartitionedCall/strided_slice_1", "op": "StridedSlice", "input": ["StatefulPartitionedCall/conditional_mapping_net/StatefulPartitionedCall/sequential_6/reshape_1/Reshape", "StatefulPartitionedCall/conditional_mapping_net/StatefulPartitionedCall/strided_slice_1/stack", "StatefulPartitionedCall/conditional_mapping_net/StatefulPartitionedCall/strided_slice_1/stack_1", "StatefulPartitionedCall/conditional_mapping_net/StatefulPartitionedCall/strided_slice_1/stack_2"], "attr": {"begin_mask": {"i": "1"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "shrink_axis_mask": {"i": "2"}, "end_mask": {"i": "1"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/conditional_mapping_net/StatefulPartitionedCall/strided_slice", "^Func/StatefulPartitionedCall/conditional_mapping_net/StatefulPartitionedCall/output_control_node/_16", "^StatefulPartitionedCall/conditional_mapping_net/StatefulPartitionedCall/NoOp"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity_1", "op": "Identity", "input": ["StatefulPartitionedCall/conditional_mapping_net/StatefulPartitionedCall/strided_slice_1", "^Func/StatefulPartitionedCall/conditional_mapping_net/StatefulPartitionedCall/output_control_node/_16", "^StatefulPartitionedCall/conditional_mapping_net/StatefulPartitionedCall/NoOp"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 987}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/conditional_mapping_net/StatefulPartitionedCall/strided_slice/stack", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/conditional_mapping_net/StatefulPartitionedCall/strided_slice/stack_1", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/conditional_mapping_net/StatefulPartitionedCall/strided_slice/stack_2", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/conditional_mapping_net/StatefulPartitionedCall/fourier_embedding/ExpandDims/dim", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/conditional_mapping_net/StatefulPartitionedCall/fourier_embedding/mul/y", "shape": [2, 1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/conditional_mapping_net/StatefulPartitionedCall/fourier_embedding/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/conditional_mapping_net/StatefulPartitionedCall/fourier_embedding/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/conditional_mapping_net/StatefulPartitionedCall/fourier_embedding/strided_slice/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/conditional_mapping_net/StatefulPartitionedCall/fourier_embedding/mul_1/x", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/conditional_mapping_net/StatefulPartitionedCall/fourier_embedding/strided_slice_1/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/conditional_mapping_net/StatefulPartitionedCall/fourier_embedding/strided_slice_1/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/conditional_mapping_net/StatefulPartitionedCall/fourier_embedding/strided_slice_1/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/conditional_mapping_net/StatefulPartitionedCall/fourier_embedding/concat/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/conditional_mapping_net/StatefulPartitionedCall/fourier_embedding/add/y", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/conditional_mapping_net/StatefulPartitionedCall/fourier_embedding/concat_1/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/conditional_mapping_net/StatefulPartitionedCall/fourier_embedding/concat_2/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/conditional_mapping_net/StatefulPartitionedCall/sequential_6/reshape_1/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/conditional_mapping_net/StatefulPartitionedCall/sequential_6/reshape_1/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/conditional_mapping_net/StatefulPartitionedCall/sequential_6/reshape_1/strided_slice/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/conditional_mapping_net/StatefulPartitionedCall/sequential_6/reshape_1/Reshape/shape/1", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/conditional_mapping_net/StatefulPartitionedCall/sequential_6/reshape_1/Reshape/shape/2", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/conditional_mapping_net/StatefulPartitionedCall/strided_slice_1/stack", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/conditional_mapping_net/StatefulPartitionedCall/strided_slice_1/stack_1", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/conditional_mapping_net/StatefulPartitionedCall/strided_slice_1/stack_2", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/conditional_mapping_net/StatefulPartitionedCall/sequential_6/ConditionalNetwork/Dense1/BiasAdd/ReadVariableOp", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/conditional_mapping_net/StatefulPartitionedCall/sequential_6/ConditionalNetwork/Dense1/MatMul/ReadVariableOp", "shape": [5, 32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/conditional_mapping_net/StatefulPartitionedCall/sequential_6/ConditionalNetwork/DenseFinal/BiasAdd/ReadVariableOp", "shape": [256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/conditional_mapping_net/StatefulPartitionedCall/sequential_6/ConditionalNetwork/DenseFinal/MatMul/ReadVariableOp", "shape": [32, 256], "dtype": "float32"}]}]}